NREL_Phase_VI_Reference/Linux Files/base_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  NREL Phase VI — controlDict
  Solver: simpleFoam with MRF rotating zone
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         3000;

deltaT          1;

writeControl    runTime;
writeInterval   1000;

purgeWrite      2;
writeFormat     binary;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   50;

        patches         (blade blade2);
        rho             rhoInf;
        rhoInf          1.225;
        log             true;
        CofR            (0 0 0);
    }

    residuals
    {
        type            solverInfo;
        libs            ("libutilityFunctionObjects.so");
        fields          (p U k omega epsilon);
        writeResiduals  true;
    }
}
