NREL_Phase_VI_Reference/Linux Files/base_case/constant/turbulenceProperties.laminar
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}

simulationType  laminar;
