NREL_Phase_VI_Reference/Linux Files/base_case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  NREL Phase VI — transportProperties
  Standard air at 15°C, 1 atm
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

// Kinematic viscosity: μ/ρ = 1.789e-5 / 1.225 = 1.460e-5 m²/s
nu              [0 2 -1 0 0 0 0]  1.460e-5;
