NREL_Phase_VI_Reference/Linux Files/base_case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (7 0 0);

boundaryField
{
    inlet  { type fixedValue; value uniform (7 0 0); }
    outlet { type inletOutlet; inletValue uniform (7 0 0); value uniform (7 0 0); }
    top    { type slip; }
    bottom { type slip; }
    side1  { type slip; }
    side2  { type slip; }
    blade  { type noSlip; }
    blade2 { type noSlip; }
}
