NREL_Phase_VI_Reference/Linux Files/base_case/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.84e-3;

boundaryField
{
    inlet  { type fixedValue; value uniform 1.84e-3; }
    outlet { type inletOutlet; inletValue uniform 1.84e-3; value uniform 1.84e-3; }
    top    { type slip; }
    bottom { type slip; }
    side1  { type slip; }
    side2  { type slip; }
    blade  { type kLowReWallFunction; value uniform 1.84e-3; }
    blade2 { type kLowReWallFunction; value uniform 1.84e-3; }
}
