NREL_Phase_VI_Reference/Linux Files/base_case/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet  { type calculated; value uniform 0; }
    outlet { type calculated; value uniform 0; }
    top    { type slip; }
    bottom { type slip; }
    side1  { type slip; }
    side2  { type slip; }
    blade  { type nutkWallFunction; value uniform 0; }
    blade2 { type nutkWallFunction; value uniform 0; }
}
