NREL_Phase_VI_Reference/Linux Files/base_case/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.261;

boundaryField
{
    inlet  { type fixedValue; value uniform 0.261; }
    outlet { type inletOutlet; inletValue uniform 0.261; value uniform 0.261; }
    top    { type slip; }
    bottom { type slip; }
    side1  { type slip; }
    side2  { type slip; }
    blade  { type omegaWallFunction; value uniform 0.261; }
    blade2 { type omegaWallFunction; value uniform 0.261; }
}
