NREL_Phase_VI_Reference/Linux Files/base_case/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  NREL Phase VI — decomposeParDict
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains  8;

method          scotch;
