NREL_Phase_VI_Reference/Linux Files/base_case/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  NREL Phase VI — surfaceFeatureExtractDict
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

blade.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 150; }
    writeObj    yes;
}

blade2.stl
{
    extractionMethod    extractFromSurface;
    extractFromSurfaceCoeffs { includedAngle 150; }
    writeObj    yes;
}
